{
    "format": "layers-model",
    "generatedBy": "keras v3.13.2",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.13.2",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "trainable": true,
                "dtype": "float32",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_layer",
                            "optional": false,
                            "batchInputShape": [
                                null,
                                15
                            ]
                        }
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding",
                            "trainable": true,
                            "dtype": "float32",
                            "input_dim": 1983,
                            "output_dim": 10,
                            "embeddings_initializer": {
                                "module": "keras.initializers",
                                "class_name": "RandomUniform",
                                "config": {
                                    "seed": null,
                                    "minval": -0.05,
                                    "maxval": 0.05
                                },
                                "registered_name": null
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": false,
                            "quantization_config": null
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 1000,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "seed": null,
                                    "gain": 1.0
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_1",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 1000,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "seed": null,
                                    "gain": 1.0
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1000,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "quantization_config": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1983,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "quantization_config": null
                        }
                    }
                ],
                "build_input_shape": [
                    null,
                    15
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "loss_weights": null,
            "metrics": null,
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 9.999999747378752e-05,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of15.bin",
                "group1-shard2of15.bin",
                "group1-shard3of15.bin",
                "group1-shard4of15.bin",
                "group1-shard5of15.bin",
                "group1-shard6of15.bin",
                "group1-shard7of15.bin",
                "group1-shard8of15.bin",
                "group1-shard9of15.bin",
                "group1-shard10of15.bin",
                "group1-shard11of15.bin",
                "group1-shard12of15.bin",
                "group1-shard13of15.bin",
                "group1-shard14of15.bin",
                "group1-shard15of15.bin"
            ],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [
                        1000,
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        1000,
                        1983
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        1983
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding/embeddings",
                    "shape": [
                        1983,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/kernel",
                    "shape": [
                        10,
                        4000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/recurrent_kernel",
                    "shape": [
                        1000,
                        4000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/bias",
                    "shape": [
                        4000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell/kernel",
                    "shape": [
                        1000,
                        4000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell/recurrent_kernel",
                    "shape": [
                        1000,
                        4000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell/bias",
                    "shape": [
                        4000
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}